app/views/comentarios/_form.html.erb

SELECT `usuarios`.* FROM `usuarios` ORDER BY nome
---
    <%= f.label :usuario_id %><br />
    <%= f.collection_select(:usuario_id, Usuario.order('nome'), :id, :nome, {:prompt => true}) %>