app/views/comentarios/index.html.erb

    <td><%= link_to 'Destroy', comentario, method: :delete, data: { confirm: 'Are you sure?' } %></td>
    <td><%= link_to 'Show Avaliacoes', Avaliacao.find(comentario.id) %></td>
---
SELECT `avaliacaos`.* FROM `avaliacaos` WHERE `avaliacaos`.`comentario_id` = 1