app/views/avaliacaos/_form.html.erb

  	<%= f.label :comentario_id %><br />
  	<%= f.collection_select(:comentario_id, Comentario.order("id"), :id, :titulo, {:prompt => true}) %>
---
SELECT `comentarios`.* FROM `comentarios` ORDER BY id