app/views/avaliacaos/index.html.erb

<br />
<p>Nota média: <%= Avaliacao.average(:nota) %></p>
---
SELECT `avaliacaos`.* FROM `avaliacaos`