app/views/usuarios/index.html.erb

SELECT SUM(`comentarios`.`id`) AS sum_id FROM `comentarios` WHERE `comentarios`.`usuario_id` = 1
SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`usuario_id` = 1 AND `comentarios`.`id` = 2 LIMIT 1
---
    <td><%= link_to 'Destroy', usuario, method: :delete, data: { confirm: 'Are you sure?' } %></td>
	<% cont = usuario.comentarios.count %>

SELECT SUM(`comentarios`.`usuario_id`) AS sum_id FROM `comentarios` WHERE `comentarios`.`usuario_id` = 1
---
						<br>
						<%= link_to usuario.comentarios.map(&:titulo)[i], 'comentarios/' + usuario.comentarios.map(&:usuario_id)[i].to_s + '/edit' %>