app/controllers/comentarios_controller.rb

SELECT `comentarios`.* FROM `comentarios`
---
  def index
    @comentarios = Comentario.all

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 1 LIMIT 1
---
  def show
    @comentario = Comentario.find(params[:id])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 11 LIMIT 1
---
  def edit
    @comentario = Comentario.find(params[:id])

INSERT INTO `comentarios` (`created_at`, `data`, `texto`, `tipo`, `titulo`, `updated_at`, `usuario_id`) VALUES ('2012-11-04 05:26:51', '2012-11-04 05:25:00', 'Este á apenas um teste. Não é válido em situações reais.', 'sugestao', 'Primeiro Comentário', '2012-11-04 05:26:51', 2)
---
  def create
    @comentario = Comentario.new(params[:comentario])

    respond_to do |format|
      if @comentario.save

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 11 LIMIT 1
UPDATE `comentarios` SET `titulo` = 'C2', `texto` = 'C2', `tipo` = 'sugestao', `data` = '2012-11-04 09:28:00', `updated_at` = '2012-11-04 09:29:01' WHERE `comentarios`.`id` = 5
---
  def update
    @comentario = Comentario.find(params[:id])

    respond_to do |format|
      if @comentario.update_attributes(params[:comentario])

SELECT `comentarios`.* FROM `comentarios` WHERE `comentarios`.`id` = 6 LIMIT 1
DELETE FROM `comentarios` WHERE `comentarios`.`id` = 6
---
  def destroy
    @comentario = Comentario.find(params[:id])
    @comentario.destroy